{
    "version": "https://jsonfeed.org/version/1",
    "title": "Crest",
    "description": "",
    "home_page_url": "https://tomoveu.github.io/crest",
    "feed_url": "https://tomoveu.github.io/crest/feed.json",
    "user_comment": "",
    "author": {
        "name": "Dimi Tomov"
    },
    "items": [
        {
            "id": "https://tomoveu.github.io/crest/thoughts-about-2017.html",
            "url": "https://tomoveu.github.io/crest/thoughts-about-2017.html",
            "title": "Thoughts about 2017",
            "summary": "I joined an Austrian company with a B2B contract to build a bootloader for a new smart home product. So many amazing things happened. The company turned 20 years in 2017 and had a beautiful new office building located in the mountains. Spacious backyard, with&hellip;",
            "content_html": "<p>I joined an Austrian company with a B2B contract to build a bootloader for a new smart home product. So many amazing things happened. </p>\n<p>The company turned 20 years in 2017 and had a beautiful new office building located in the mountains. Spacious backyard, with football field, garden and leisure area. </p>\n<p>The product was a smart home bed, with sensors,  motors and Bluetooth connectivity. I joined the project in its last development phase. We were four months before mass production. This is quite late for developing and integrating bootloader into a smart product. </p>\n<h2 id=\"amazing-1\">Amazing #1</h2>\n<p>The first week was full of emotions. Three different devices, two in the smart bed and one acting as a remote for the user, all working together. I had to create a way to perform software updates in the field of all three. This meant I could create three device-specific solutions or create one device-agnostic solution.</p>\n<p>Not only that I like a challenge, but I have named my R&amp;D company Design First. So, I chose to try and create the technical design of the bootloader before I start implementing it. This way, I could achieve one solution for all three different devices.</p>\n<p>To my surprise, the architect and team lead supported my decision.\nI had about 10 days to create the design and pass two iterations of review. It was spectacular.</p>\n<p>We created a bootloader that can run on any hardware using any transport. Bluetooth, USB, serial port, anything, it worked. As far as I know, the company is using this bootloader across products to this day. </p>\n<blockquote>\n<p>8 years of continuing cost savings thanks to 10 days of design upfront.</p>\n</blockquote>\n<h2 id=\"amazing-2\">Amazing #2</h2>\n<p>The Austrian company moved from medium sized business to large (beyond 250 employees). Somehow kept engineering autonomous for its own tasks. At the same time R&amp;D influenced other teams. Cross-team communication was happening well. This was amazing to experience.</p>\n<p>I often wondered what is the ideal team and company size. Of course, ideal size does not exist, but I wanted to find out when do we start to lose the human touch. When do we start to struggle with remembering our colleagues’ names? When do we start forgetting the personal stories of colleagues who we do not meet so often?</p>\n<p>In my mind, I had put a rough number of a 100 people. Over time, I found out that we fail to remember peoples’ names beyond 60-70, what’s left for their stories. There is also another aspect of this, when does team (company) size start to create friction?</p>\n<blockquote>\n<p>More than 15 years of experience later, I can say around 30 people is when work friction becomes noticable.</p>\n</blockquote>\n<p>In a team of 30, everybody knows everybody, it is like a small community or neighbourhood. This is one more reason for the low friction in smaller teams and companies. At 60 people, we have many teams and friction increases.</p>\n<p>This is why I found the low friction in the Austrian company for amazing. Aftereffect from a small engineering team that remained autonomous and listening product owner. The engineering team, includes the team lead and architect.</p>\n<p>One more impression from 2017 - Team leads do not work with timelines, product owners do. If you don’t need product owners, find project managers. Team lead should not be a very technical role.</p>\n<h2 id=\"amazing-3\">Amazing #3</h2>\n<p>Back to the Austrian company, founded in 1997, bootstrapped with no external investment. Fast forward 5 years, a private US investor joins the company with a minority stake. Sometime later, the US investment grew alongside the company that hit about $500 million sales in 2017. What is amazing about this?</p>\n<blockquote>\n<p>Company grew from 120 to 250 people in 18 months and this is NOT a venture capital (VC) investment.</p>\n</blockquote>\n<p>250 people is a lot. When I was asking for contacts to other teams, sometimes the team lead had to search for them. One time, he opened Microsoft Outlook and searched in the email directory of the company. With a smile, he said: “Even I do not know everybody anymore, and I am with the company for over 10 years now”.</p>\n<h2 id=\"afterthoughts\">Afterthoughts</h2>\n<p>CEO stepped down as Chairman and gave an amazing speech during the annual meeting. US investors flown in. Great vibe. I worked through half of the event, so we can deliver the product on time and it felt good. This work day was off for employees, and for me as an external person, it was okay to work.</p>\n<p>In my career, I have seen many small, medium and large companies. Profit-loss models deceive us of what is going on. Business Units are also not a solution. Even if you split everything in BUs and teams, scale comes with the friction.  </p>\n<blockquote>\n<p>Friction does not become less. It always increases. So, make changes now or friction will hurt your employees and customers. </p>\n</blockquote>\n<p>Adapt time off, adapt work conditions, adapt projects, adapt buffers. If you can not adapt, downsize by choice. If you miss the window of opportunity to act, you can face downsize because of necessity. Join different teams and work along side to feel their pain in-person. This is a quick way to figure out what and how to adapt.</p>\n<p>Thank you for reading my flashback.</p>\n<p>/Dimi</p>\n",
            "author": {
                "name": "Dimi Tomov"
            },
            "tags": [
            ],
            "date_published": "2023-07-24T14:41:00+03:00",
            "date_modified": "2023-07-24T14:43:05+03:00"
        }
    ]
}
